Page({

  /**
   * 页面的初始数据
   */
  data: {
    recommendList:[
      {
        id: "36",
        tips: "赏樱季目的地推荐",
        title: "去北海道，抓住樱花季的尾巴",
        detail:"4月底，北海道的春天才刚刚到来。4月底，北海道的春天才刚刚到来。4月底，北海道的春天才刚刚到来。4月底，北海道的春天才刚刚到来。"
      },
      {
        id: "36",
        tips: "赏樱季目的地推荐",
        title: "去北海道，抓住樱花季的尾巴",
        detail: "4月底，北海道的春天才刚刚到来。4月底，北海道的春天才刚刚到来。4月底，北海道的春天才刚刚到来。4月底，北海道的春天才刚刚到来。"
      },
      {
        id: "36",
        tips: "赏樱季目的地推荐",
        title: "去北海道，抓住樱花季的尾巴",
        detail: "4月底，北海道的春天才刚刚到来。4月底，北海道的春天才刚刚到来。4月底，北海道的春天才刚刚到来。4月底，北海道的春天才刚刚到来。"
      },
      {
        id: "36",
        tips: "赏樱季目的地推荐",
        title: "去北海道，抓住樱花季的尾巴",
        detail: "4月底，北海道的春天才刚刚到来。4月底，北海道的春天才刚刚到来。4月底，北海道的春天才刚刚到来。4月底，北海道的春天才刚刚到来。"
      },
    ],
    historyRoomData:[
      {
        id:"36",
        des:"1卧2床1卫",
        name:"威尼斯彩虹岛民宿威尼斯彩虹岛民宿威尼斯彩虹岛民宿威尼斯彩虹岛民宿",
        price:"¥200每晚，免费取消预订",
        comment:"95%好评"
      },
      {
        id:"72",
        des:"1卧1床1卫",
        name: "佛罗伦萨城市火车站民宿佛罗伦萨城市火车站民宿佛罗伦萨城市火车站民宿佛罗伦萨城市火车站民宿",
        price:"¥200每晚，免费取消预订",
        comment:"96%好评"
      },
      {
        id: "36",
        des: "1卧2床1卫",
        name: "威尼斯彩虹岛民宿威尼斯彩虹岛民宿威尼斯彩虹岛民宿威尼斯彩虹岛民宿",
        price: "¥200每晚，免费取消预订",
        comment: "95%好评"
      },
      {
        id: "72",
        des: "1卧1床1卫",
        name: "佛罗伦萨城市火车站民宿",
        price: "¥200每晚，免费取消预订",
        comment: "96%好评"
      },
      {
        id: "36",
        des: "1卧2床1卫",
        name: "威尼斯彩虹岛民宿",
        price: "200每晚",
        comment: "95%好评"
      },
      {
        id: "72",
        des: "1卧1床1卫",
        name: "佛罗伦萨城市火车站民宿",
        price: "320每晚",
        comment: "96%好评"
      },
      {
        id: "36",
        des: "1卧2床1卫",
        name: "威尼斯彩虹岛民宿",
        price: "200每晚",
        comment: "95%好评"
      },
      {
        id: "72",
        des: "1卧1床1卫",
        name: "佛罗伦萨城市火车站民宿",
        price: "320每晚",
        comment: "96%好评"
      },
      {
        id: "36",
        des: "1卧2床1卫",
        name: "威尼斯彩虹岛民宿威尼斯彩虹岛民宿威尼斯彩虹岛民宿",
        price: "200每晚",
        comment: "95%好评"
      },
      {
        id: "72",
        des: "1卧1床1卫",
        name: "佛罗伦萨城市火车站民宿佛罗伦萨城市火车站民宿佛罗伦萨城市火车站民宿",
        price: "320每晚",
        comment: "96%好评"
      },
      {
        id: "36",
        des: "1卧2床1卫",
        name: "威尼斯彩虹岛民宿威尼斯彩虹岛民宿威尼斯彩虹岛民宿",
        price: "200每晚",
        comment: "95%好评"
      },
      {
        id: "72",
        des: "1卧1床1卫",
        name: "佛罗伦萨城市火车站民宿佛罗伦萨城市火车站民宿佛罗伦萨城市火车站民宿佛罗伦萨城市火车站民宿",
        price: "320每晚",
        comment: "96%好评"
      },
    ]
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {
    wx.setNavigationBarTitle({
      title: 'Airbnb 爱彼迎民宿您的优质选择',
    })
    
  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {
    
  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {
    
  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {
    
  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {
    
  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {
    
  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {
    
  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {
    
  }
})